# GetFrameAzimuth Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..GetFrameAzimuth Method
SunAndShadowSettings Class See Also
---
Identifies the azimuth of the sun (angle in radians) for a specific frame.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double GetFrameAzimuth(
	double frame
)
```

Visual Basic
---
```text
Public Function GetFrameAzimuth ( _
	frame As Double _
) As Double
```

Visual C++
---
```text
public:
double GetFrameAzimuth(
	double frame
)
```

# ### Parameters
frame
    Type: System..::..Double Frame for which time is requested
# ### Return Value
Azimuth angle (radians). This is measured counterclockwise from the X axis (East direction). Note that this is a different frame of reference than is used by Revit for the Lighting Study Azimuth value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | the frame value frame is not valid. |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace